nku-net/app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("author", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Dr. Testing"], ["body", "Dr. Demo's answer seems sufficient."], ["post_id", 1], ["created_at", "2017-03-11 21:16:42.208146"], ["updated_at", "2017-03-11 21:16:42.208146"]]
---
  def create
    @post = Post.find(params[:post_id])

    if @post.comments.create(comment_params)