nku-net/app/views/posts/index.html.erb

      <%= link_to post, class: "list-group-item" do %>
        <strong><%= post.author %>:</strong> <%= post.title %> <span class="badge"><%= post.comments.count %></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]