app/views/posts/show.html.erb

    <!-- Comments Nested Section -->
    <% @post.comments.each do |someComment| %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 2], ["id", 3]]