app/controllers/comments_controller.rb

  def edit
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", 2]]

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)

    if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("author", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "AY GURL"], ["body", "Give me dat body "], ["post_id", 1], ["created_at", "2017-03-16 19:56:05.642891"], ["updated_at", "2017-03-16 19:56:05.642891"]]

  def update
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

    respond_to do |format|
      if @comment.update(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", 2]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "EDITED!!! :D"], ["updated_at", "2017-03-17 17:55:08.028465"], ["id", 2]]