app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @course = Course.find(params[:course_id])
    @post = @course.posts.find(params[:id])

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Taco Cats"], ["body", "I like cats//////////////////////////////////////////////////"], ["created_at", "2017-03-12 00:21:06.008623"], ["updated_at", "2017-03-12 00:21:06.008623"]]
---
  def create
    @course = Course.find(params[:course_id])
    @post = @course.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    @course = Course.find(params[:course_id])
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
    @course = Course.find(params[:course_id])
    @post.destroy